EDITIONS = [
  {
    id: 1,
    name: "ЮРИДИЧЕСКАЯ НАУКА",
    description: "В журнале публикуются научные статьи различных исследователей (докторов и кандидатов наук, аспирантов и соискателей), специалистов-практиков (судей, работников прокуратуры, адвокатов, нотариусов, государственных и муниципальных служащих) более чем из сорока пяти субъектов Российской Федерации, а также зарубежных ученых. Широкая специализация журнала позволяет публиковать на его страницах статьи по теоретическим и практическим проблемам всех отраслей юридической науки, а также размещать материалы, содержащие междисциплинарные исследования. Журнал включен в перечень рецензируемых научных изданий, в которых должны быть опубликованы основные научные результаты диссертаций на соискание ученой степени кандидата наук, на соискание ученой степени доктора наук (Список научных журналов ВАК). Периодичность выхода: 6 раз в год. КиберЛенинка: https://cyberleninka.ru/journal/n/yuridicheskaya-nauka"
  },
  {
    id: 2,
    name: "Правовое государство: теория и практика",
    description: 'Общественно-политический и науч    но-правовой журнал «Правовое государство:теория и практика"(печать) ISSN 2500-0217 входит в обновлённый список Перечня ВАК при Мин обрнауки РФ с 1 декабря 2015 г. С 2005 года журнал «Правовое государство: теория и практика» включен в Российский индекс научного цитирования (РИНЦ) Российской научной электронной библиотеки eLIBRARY.RU'
  },
  {
    id: 3,
    name: "Вопросы российского и международного права",
    description: "Все больше по объему становится журнал «Вопросы российского и международного права», все больше публикаций на английском языке появляются в нем. Это говорит о том, что данное издание востребовано в мире юридической науки, что все больше и больше исследователей доверяют нашему журналу, размещая в нем свои юридические статьи, ознакомиться с которыми Вы можете в «Тематических обзорах Архива», где представлены научные статьи по темам, в т.ч. и юридические статьи на английском языке с переводом. Мы не сомневаемся, что Ваше знакомство с архивом публикаций журнала по юриспруденции принесёт Вам ощутимую пользу в работе над собственным научным исследованием."
  }
]

ARTICLES = [
  {
    name: "Современное состояние института переводчика в уголовном процессе: проблемы и пути их решения",
    description: "Современное состояние института переводчика в уголовном процессе: проблемы и пути их решения",
    annotation: "В статье рассматриваются вопросы участия переводчика в уголовном процессе и его статуса – правового и языковой личности переводчика. Предлагаются пути решения ряда проблем, которые не урегулированы действующим законодательством.",
    content: "В основу деятельности переводчика заложены конституционные нормы, предоставляющие каждому право на пользование родным языком, на свободный выбор языка общения, на использование государственного языка Российской Федерации и государственных языков республик, входящих в ее состав (ч. 2 ст. 26, ст. 68 Конституции РФ). Правила регламентации языка уголовного судопроизводства в действующем УПК рассматриваются в качестве принципа уголовного судопроизводства (ст. 18). Но этим не исчерпывается законодательное регулирование языка судопроизводства и делопроизводства.

Многочисленные нормы российского законодательства посвящены праву участников уголовного процесса бесплатно пользоваться помощью переводчика, например: ст. 10 «Язык судопроизводства и делопроизводства в судах» Федерального конституционного закона РФ «О судебной системе Российской Федерации» от 31 декабря 1996 г. № 1-ФКЗ, ст. 6 «Язык судопроизводства и делопроизводства в военных судах» Федерального конституционного закона РФ «О военных судах Российской Федерации» от 23 июня 1999 г. № 1-ФКЗ, ст. 3 «Правовое положение языков», ст. 18 «Язык судопроизводства и делопроизводства в судах и правоохранительных органах» Закона РФ «О языках народов Российской Федерации» от 25 октября 1991 г. № 1870-1, ст. 3 «Сферы использования государственного языка Российской Федерации» и ст. 5 «Обеспечение права граждан Российской Федерации на пользование языком Российской Федерации» Федерального закона РФ «О государственном языке Российской Федерации» от 1 июня 2005 г. № 53-Ф3.

Участие переводчика в производстве по уголовному делу является одной из гарантий реализации каждым, кто вовлекается в уголовное судопроизводство, предоставленных ему полномочий (делать заявления, давать показания, заявлять ходатайства, приносить жалобы, защищаться от предъявленного обвинения, знакомиться с материалами уголовного дела, выступать в суде и т.п.).",
    access_level: 1,
    edition_id: 1
  },
  {
    name: "Понятие и сущность уголовного процесса",
    description: "Любое государство, будучи важнейшей формой организации цивилизованного общества, возлагает на себя множество социально значимых функций. Одной из них, как известно, является охранительная функция, обусловленная необходимостью защиты интересов общества и государства от противоправных посягательств, создающих опасность для их развития и жизнедеятельности.",
    annotation: "Несомненно, что современное демократическое правовое государство призвано в первую очередь обеспечивать защиту прав, свобод и законных интересов человека и гражданина, а также общества в целом, конституционного строя государства и иных значимых социальных благ.",
    content: "Между тем подобные материальные нормы не способны самореализовываться, т.е. автоматически применяться к лицам, совершившим преступления. Такая реализация возможна только в процессе осуществления специальной юрисдикционной деятельности, позволяющей установить все имеющие уголовно-правовое значение обстоятельства, правильно квалифицировать содеянное и на основании этого вынести законный, обоснованный и справедливый правоприменительный акт государственно-властного характера. Правом осуществления такой деятельности могут быть наделены только определенные государственные органы (органы дознания, предварительного следствия, прокуратура и суд), более того, указанная деятельность, имея юрисдикционную направленность, должна быть строго формализованной, т.е. производиться только в порядке, установленном процессуальным законом. Эта деятельность называется уголовно-процессуальной или просто уголовным процессом.

Термин «уголовный процесс» образован от старославянского слова «уголовье» и латинского «processus». Уголовьем на Руси называли преступление, т.е. такое противоправное деяние, за которое в буквальном смысле слова человек мог лишиться головы. «Processus» дословно в переводе с латинского означает продвижение, а в русском языке под процессом понимается, в том числе и порядок разбирательства судебных и административных дел. Таким образом, термин «уголовный процесс» дословно означает порядок разбирательства дел о преступлениях.",
    access_level: 0,
    edition_id: 2
  },
  {
    name: "Порядок и сроки дознания по уголовным делам",
    description: "Предварительное расследование в форме дознания производится в порядке, установленном главами 21, 22 и 24— 29 УПК, с изъятиями, предусмотренными законом. ",
    annotation: "Дознание производится по уголовным лазам, указанным в ч. 3 ст. 150 УПК. Этот перечень включает 93 состава преступлений, предусмотренных Особенной частью УК.",
    content: "Дознание производится по следующим уголовным делам:

1) по уголовным делам о преступлениях, предусмотренных ст. 112, 115, 116, 117 ч. 1, 118, 119, 121, 122 ч. 1 и 2, 123 ч. 1, 125, 127 ч. 1, 129, 130, 150 ч. 1, 151 ч. 1, 153-157, 158 ч. 1, 159 ч. 1, 160 ч. 1, 161 ч. 1, 163 ч. 1, 165 ч. 1 и 2, 166 ч. 1, 167 ч. 1, 168, 170, 171 ч. 1, 171.1 ч. 1, 175 ч. 1 и 2, 177, 180 ч. 1 и 2, 181 ч. 1, 188 ч. 1, 194, 203, 207, 213 ч. 1, 214, 218, 219 ч. 1, 220 ч. 1, 221 ч. 1, 222 ч. 1 и 4, 223 ч. 1 и 4, 224, 228 ч. 1, 228.2, 230 ч. 1, 231 ч. 1, 232 ч. 1, 233, 234 ч. 1 и 4, 240 ч. 1, 241 ч. 1, 242, 243 -245, 250 ч. 1, 251 ч. 1, 252 ч. 1, 253, 254 ч. 1. 256-258, 260 ч. 1, 261 ч. 1, 262, 266 ч. 1, 268 ч. 1, 294 ч. 1, 297, 311 ч. 1, 312, 313 ч. 1, 314, 315, 319, 322 ч. 1, 322.1 ч. 1, 323 ч. 1, 324-326, 327 ч. 1 и 3, 327.1 ч. 1, 329 и 330 ч. 1 Уголовного кодекса Российской Федерации;

2) об иных преступлениях небольшой и средней тяжести — по письменному указанию прокурора.

При производстве предварительного расследования по делам, отнесенным к подследственности органов дознания, дознаватель уполномочен самостоятельно производить следственные и иные процессуальные действия и принимать процессуальные решения, за исключением тех из них, на которые требуется согласие начальника органа дознания, решение прокурора и (или) судебное решение. Дознаватель вправе осуществлять иные полномочия, предоставленные ему УПК.",
    access_level: 1,
    edition_id: 3
  },
  {
    name: "Процессуальный порядок рассмотрения жалоб",
    description: "Содержание, вид и форма жалобы законом не регламентируются: она может быть письменной или устной и излагается произвольно.",
    annotation: "Жалоба на действия (бездействие) и решение следователя, дознавателя могут быть поданы надзирающему прокурору, руководителю следственного органа или в суд.",
    content: "Жалоба на действия (бездействие) и решение следователя, дознавателя могут быть поданы надзирающему прокурору, руководителю следственного органа или в суд. Участники процесса и иные лица, чьи интересы затрагивают производимые процессуальные действия и решения, могут обратиться с жалобой к прокурору на личном приеме, который осуществляется ежедневно во всех структурах органов прокуратуры. Прокурор, руководитель следственного органа рассматривает жалобу в течение 3 сут. со дня ее получения или в течение 10 сут., если для проверки жалобы необходимо истребовать дополнительные материалы или принять иные меры, о чем извещается заявитель (ч. 1 ст. 124 УПК).

Жалоба в устной форме должна быть занесена дознавателем, следователем, в протокол, составляемый в соответствии со ст. 166 УПК (судом — в протокол судебного заседания). При подаче жалобы участники уголовного судопроизводства могут использовать родной язык или другой язык, которым они владеют (ч. 2 ст. 18 УПК). Дознаватель, следователь и суд должны обеспечить возможность лицу при подаче жалобы бесплатно пользоваться услугами переводчика",
    access_level: 0,
    edition_id: 1
  },
  {
    name: "Понятие и виды иных мер процессуального принуждения",
    description: "Законодатель предусмотрел отдельную главу об иных мерах процессуального принуждения.",
    annotation: "В соответствии со ст. 111 УПК их определяют как разновидность мер уголовно-процессуального принуждения, которые применяются в целях обеспечения установленного Уголовно-процессуальным кодексом РФ порядка уголовного судопроизводства, надлежащего исполнения приговора.",
    content: "Наложение ареста на имущество. В соответствии с ч. 1 ст. 115 УПК для обеспечения исполнения приговора в части гражданского иска других имущественных взысканий или возможной конфискации имущества указанного в ч. 1 ст. 104.1 Уголовного кодекса Российской Федерации, следователь с согласия руководителя следственного органа, а также дознаватель с согласия прокурора возбуждают перед судом ходатайство о наложении ареста на имущество подозреваемого, обвиняемого или лиц, несущих по закону материальную ответственность за их действия. Суд рассматривает ходатайство в порядке, установленном ст. 165 УПК РФ. При решении вопроса о наложении ареста на имущество для обеспечения возможной конфискации суд должен указать на конкретные, фактические обстоятельства, на основании которых он принял такое решение.",
    access_level: 0,
    edition_id: 2
  }
]

STATICPAGES = [
  {
    slug: "about",
    body: '<div><img src="http://localhost:3000/static/media/about.3650b801.jpg" alt="О журнале" title="О журнале" style="display: block; max-width: 100%;"><br><div>Издается с 2017 года. Выходит 1 раз в полугодие.</div><br><div>Учредитель – Следственный комитет Республики Беларусь.</div><div>Publisher – Investigative Committee of the Republic of Belarus</div><br><div>Главный редактор – Суздалева Галина Валерьевна</div><div>Chief editor – Galina V. Suzdaleva</div><br><div>Научный редактор – к.&thinsp;ю.&thinsp;н. Каменецкий Юрий Францевич</div><div>Science editor – Candidate of Juridical Sciences (PhD in Law) Yuriy F. Kamenetskiy</div><br><div>Адрес редакции: ул. Фрунзе, 19, г. Минск, 220034</div><div>The address of the Editorial office: 19 Frunze st., 220034 Minsk, Belarus</div><div>тел./факс (phone/fax): +375 17 389 52 29</div><div><!-- react-text: 153 -->е-mail:<!-- /react-text --><!-- react-text: 154 --> <!-- /react-text --><a href="mailto:journal_investigation@sledcom.by">journal_investigation@sledcom.by</a></div><br><br><div>Свидетельство о государственной регистрации средства массовой информации № 1838 от 12.01.2017, выданное Министерством информации Республики Беларусь.</div><br></div>'
  },
  {
    slug: "collegium",
    body: '<div class="CollegiumContent"><div style="display: flex; align-items: center;"><div style="float: left;"><img src="http://localhost:3000/static/media/noskevic.938fa841.jpg" alt="Носкевич Иван Данилович" title="Носкевич Иван Данилович" style="height: 150px; border-radius: 50%; margin-right: 20px;"></div><div><div>ПРЕДСЕДАТЕЛЬ</div><div>НОСКЕВИЧ Иван Данилович, Председатель Следственного комитета Республики Беларусь</div></div></div><br><div>ЗАМЕСТИТЕЛЬ ПРЕДСЕДАТЕЛЯ</div><div>ГАЙДУЧЁНОК Валерий Александрович</div><br><div>ЧЛЕНЫ КОЛЛЕГИИ:</div><div>АНДРЕЕВА Наталья Александровна</div><div>ВАВУЛО Михаил Николаевич</div><div>ВАРАВКО Юрий Валерьевич</div><div>КАБАКОВИЧ Сергей Васильевич</div><div>ЛАВРИНОВИЧ Светлана Геннадьевна</div><div>МАЛИНОВСКИЙ Эдуард Викторьевич</div><div>МОТОЛЬКО Андрей Фёдорович</div><div>УДОВИКОВ Сергей Александрович</div><div>ШАНДАРОВИЧ Олег Станиславович</div><br></div>'
  },
  {
    slug: "board",
    body: '<div><img src="http://localhost:3000/static/media/board.8b499d34.jpg" alt="Редакционный совет" title="Редакционный совет" style="display: block; max-width: 100%;"><br><div>ПРЕДСЕДАТЕЛЬ</div><div>ГРУНТОВ Игорь Олегович, д. ю. н., доцент заведующий кафедрой уголовного права учреждения образования «Белорусский государственный университет»</div><br><div>ЧЛЕНЫ СОВЕТА:</div><div>БАСТРЫКИН Александр Иванович, д. ю. н., профессор, Председатель Следственного комитета Российской Федерации</div><div>ОВСЕПЯН Агван Гарникович, д. ю. н. Председатель Следственного комитета Республики Армения</div><div>АНАНИЧ Валерий Антонович, д. и. н., к.ю. н., профессор</div><div>ГОДУНОВ Валерий Николаевич, д.ю. н., профессор</div><div>ГУЧОК Александр Евгеньевич, д.ю. н., доцент</div><div>ЕРМОЛОВИЧ Владимир Фёдорович, д.ю. н., профессор</div><div>КАПЛИНА Оксана Владимировна, член-корреспондент Национальной академии правовых наук Украины, д. ю. н., профессор</div><div>КАЧАЛОВА Оксана Валентиновна, д. ю. н., профессор (Российская Федерация)</div><div>КНЯЗЕВ Станислав Никифорович, д.ю. н., профессор</div><div>РУБИС Александр Сергеевич, д.ю. н., доцент</div><div>ТАЦИЙ Василий Яковлевич, академик Национальной академии наук Украины, д.ю. н., профессор</div><div>ЧУЕШОВ Виктор Иванович, д.ф. н., профессор</div><div>ШАБАНОВ Вячеслав Борисович, д.ю. н., профессор</div><div>ШИЕНОК Владимир Петрович, д.ю. н., профессор</div><div>БАРКОВ Александр Владимирович, к.ю. н, профессор</div><div>ЗАЙЦЕВА Людмила Львовна, к.ю. н, доцент</div><br></div>'
  },
  {
    slug: "for-authors",
    body: '<div><img src="http://localhost:3000/static/media/for-authors.1ff09cb8.jpg" alt="Авторам" title="Авторам" style="display: block; max-width: 100%;"><br><div>Принимается к печати оригинальный материал, не опубликованный ранее.</div><br><div><!-- react-text: 341 -->Рукописи (объем не менее 14&#8202;&thinsp;000 знаков и не более 25&thinsp;&#8202;000 знаков) направляются научному редактору журнала в бумажном или электронном виде (на электронном носителе или по электронной почте<!-- /react-text --><!-- react-text: 342 --> <!-- /react-text --><a href="mailto:journal_investigation@mail.ru">journal_investigation@mail.ru</a><!-- react-text: 344 -->,<!-- /react-text --><!-- react-text: 345 --> <!-- /react-text --><a href="mailto:journal_investigation@sledcom.by">journal_investigation@sledcom.by</a><!-- react-text: 347 --> <!-- /react-text --><!-- react-text: 348 -->в формате .rtf или .doc) на белорусском, русском и (или) английском языках.<!-- /react-text --></div><br><div>Содержание статьи должно соответствовать тематическим направлениям и научному уровню журнала, обладать определенной новизной и представлять интерес для широкого круга читателей. Текст работы должен быть изложен научным языком (с присущими ему логичностью, объективностью, смысловой точностью (однозначностью выражения мысли), информативной насыщенностью, отсутствием образности и эмоциональности), иметь четкую структуру.</div><br><div>Статьи должны включать следующие элементы: индекс УДК, данные автора (авторов), название; ключевые слова, введение, основная часть, заключение, список литературы, а также быть оформлены в соответствии с требованиями главы 5 Инструкции о порядке оформления квалификационной научной работы (диссертации) на соискание ученых степеней кандидата и доктора наук, автореферата и публикаций по теме диссертации (утверждена постановлением Высшей аттестационной комиссии Республики Беларусь от 28.02.2014 № 3).</div><br><div>Авторы опубликованных материалов несут ответственность за достоверность приведенных фактов и сведений, а также за содержание в материалах данных, не подлежащих открытой публикации.</div><br><div>Редакция может печатать статьи в порядке обсуждения, научной дискуссии, не разделяя мнение автора.</div><br><div>Журнал оставляет за собой право вносить перед публикацией редакторскую правку. Рукописи авторов не возвращаются.</div><br><div>Воспроизведение материалов допускается только с письменного разрешения учредителя, ссылка на журнал «Предварительное расследование» обязательна.</div><br></div>'
  },
  {
    slug: "events",
    body: '<div><img src="http://localhost:3000/static/media/events.125c25f7.jpg" alt="События и новости" title="События и новости" style="display: block; max-width: 100%;"><br></div>'
  },
  {
    slug: "policy",
    body: '<div><div><b>Редакционная политика</b><!-- react-text: 80 --> издания определена реалиями времени и спецификой деятельности ведомства. Ее главная цель — создание платформы между наукой и практикой для совершенствования следственной деятельности. Поэтому среди первых авторов — &thinsp;&#8203;практики и видные ученые с активной жизненной позицией. Особо приветствуется коллаборация (сотрудничество) авторов, совместная подготовка материалов следователями и представителями научного сообщества. Надеемся, журнал будет полезен для большого круга читателей.<!-- /react-text --></div><br><div><b>География публикаций</b><!-- react-text: 84 --> весьма широка. Кроме актуальных вопросов досудебного производства Беларуси, в первом номере опубликованы материалы российских и армянских коллег. Планируем, что в ближайших номерах журнала найдут достойное место статьи авторов ближнего и дальнего зарубежья, а его страницы станут международной площадкой по обмену мнениями и опытом.<!-- /react-text --></div><br><div><b>Миссия журнала</b><!-- react-text: 88 --> состоит не только в том, чтобы поднимать сложные проблемы юриспруденции, но и освещать основные этапы развития органов следствия республики в контексте современной истории правоохранительных органов, а также состояние законодательства и опыт правоприменения других стран.<!-- /react-text --></div><br><div><!-- react-text: 91 -->Приглашаем оформить подписку на журнал «Предварительное расследование» (<!-- /react-text --><b>каталог РУП «Белпочта»</b><!-- react-text: 93 -->, подписной индекс: для предприятий и организаций — &#8203;<!-- /react-text --><b>748352</b><!-- react-text: 95 -->, для индивидуальных подписчиков — <!-- /react-text --><b>74835</b><!-- react-text: 97 -->).<!-- /react-text --></div><br></div>'
  }
]

EDITIONS.each do |edition_params|
  unless Edition.find_by(name: edition_params[:name])
    edition = Edition.new(edition_params)
    edition.save(validate: false)
  end
end

ARTICLES.each do |article_params|
  unless Article.find_by(name: article_params[:name])
    article = Article.new(article_params)
    article.save(validate: false)
  end
end

STATICPAGES.each do |static_page_params|
  unless StaticPage.find_by(slug: static_page_params[:slug])
    static_page = StaticPage.new(static_page_params)
    static_page.save(validate: false)
  end
end

if Rails.env.development?
  unless AdminUser.find_by(email: 'admin@example.com')
    admin = AdminUser.create(email: 'admin@example.com', password: 'password', password_confirmation: 'password')
    admin.add_role :admin
    redactor = AdminUser.create(email: 'redactor@example.com', password: 'password', password_confirmation: 'password')
  end

  (1..5).each do |i|
    i = i.to_s
    unless User.find_by_email("user#{i}@gmail.com")
      user = User.create!(email: "user#{i}@gmail.com", password: "12345678", password_confirmation: "12345678")
      Profile.find_by(user_id: user.id).update!(first_name: "#{i}-й", last_name: "Пользователь", phone: "+37529#{i*7}")
    end
  end

  user = User.first
  edition1 = Edition.first
  edition2 = Edition.last

  sub_request = SubscriptionRequest.find_or_create_by(name: user.full_name, email: user.email, phone: user.profile.phone, user: user, edition: edition2)
  sub_request = SubscriptionRequest.find_or_create_by(name: user.full_name, email: user.email, phone: user.profile.phone, user: user, edition: edition1, status: "approved")
  subscription = Subscription.find_or_create_by(user: user, edition: edition1, subscription_request: sub_request)
end