import React from "react";

export default function IssueContent() {
  return (
    <div>
      <div>№1(1)/2017</div>
      <br />

      <div>
        <b>КОЛОНКА РЕДАКТОРА</b>
      </div>
      <div>
        <ul>
          <li>Приглашаем авторов</li>
          <li>Напутствия и пожелания&nbsp;</li>
          <li>О первых шагах журнала</li>
        </ul>
      </div>
      <div>
        <br />
      </div>
      <div>
        <b>СОБЫТИЯ И НОВОСТИ</b>
      </div>
      <div>
        <ul>
          <li>Заседание коллегии Следственного комитета Республики Беларусь</li>
          <li>Совместное заседание коллегий следственных комитетов</li>
          <li>Международное сотрудничество</li>
          <li>Обучение и обмен опытом</li>
        </ul>
      </div>
      <div>
        <b>
          <br />
        </b>
      </div>
      <div>
        <b>НАУЧНЫЕ ПУБЛИКАЦИИ</b>
      </div>
      <div>
        <ul>
          <li>
            Шиенок В.&thinsp;П. Коррупция: методология проблемы, причины, ранняя
            диагностика
          </li>
          <li>
            Бастрыкин А.&thinsp;И. Проблемы реализации норм международного
            гуманитарного права
          </li>
          <li>
            Григорян Г.&thinsp;М. Проблемы криминализации норм о военных
            преступлениях в национальное законодательство Республики Армения
          </li>
          <li>
            Мороз Д.&thinsp;Г. Формы причинения имущественного ущерба без
            признаков хищения (ст. 216 Уголовного кодекса Республики Беларусь)
          </li>
          <li>
            Данько И.&thinsp;В. О некоторых проблемах правового регулирования
            положения потерпевшего в уголовном процессе
          </li>
          <li>
            Шимко А.&thinsp;М. О целесообразности возбуждения уголовного дела в
            случае установления факта истечения сроков давности
          </li>
        </ul>
      </div>
      <div>
        <br />
      </div>
      <div>
        <b>ИСТОРИЧЕСКИЙ ОПЫТ И СЛЕДСТВЕННЫЕ ТРАДИЦИИ</b>
      </div>
      <div>
        <ul>
          <li>
            Миклашевский М.&thinsp;И. История возникновения органов
            предварительного расследования на территории Беларуси
          </li>
          <li>
            Скачек Р.&thinsp;В., Мельник Л.&thinsp;Л. Генезис представлений об
            использовании информационных технологий в деятельности следователя
          </li>
        </ul>
      </div>
      <div>
        <br />
      </div>
      <div>
        <b>СЛЕДСТВЕННАЯ ПРАКТИКА</b>
      </div>
      <div>
        <ul>
          <li>
            Попов Е.&thinsp;М., Василюк А.&thinsp;В. О положительном опыте
            расследования преступлений, предусмотренных ст. 253 Уголовного
            кодекса Республики Беларусь
          </li>
          <li>
            Кузьмичев С.&thinsp;А. Электронные следы как ключевое доказательство
            деятельности организованной группы наркосбытчиков Гомельщины
          </li>
          <li>
            Заяц А.&thinsp;В. Ключ к разгадке в деле об убийстве
            неустановленного лица
          </li>
        </ul>
      </div>
      <div>
        <b>
          <br />
        </b>
      </div>
      <div>
        <b>КОММЕНТАРИИ И АНАЛИЗ</b>
      </div>
      <div>
        <ul>
          <li>
            Севченко В.&thinsp;А. Организация информационно-аналитической
            деятельности в Следственном комитете Республики Беларусь&nbsp;
          </li>
        </ul>
      </div>
      <div>
        <b>
          <br />
        </b>
      </div>
      <div>
        <b>СЛУЖБА В СЛЕДСТВЕННОМ КОМИТЕТЕ</b>
      </div>
      <div>
        <ul>
          <li>Участие в общественной жизни республики</li>
          <li>Год науки</li>
          <li>День победы</li>
          <li>Спортивная жизнь</li>
          <li>Государственные награды</li>
          <li>Назначения</li>
          <li>Поздравляем с присвоением очередных специальных званий</li>
        </ul>
      </div>
    </div>
  );
}
