import React from "react";

export default function PolicyContent() {
  return (
    <div>
      <div>
        <b>Редакционная политика</b> издания определена реалиями времени и
        спецификой деятельности ведомства. Ее главная цель — создание платформы
        между наукой и практикой для совершенствования следственной
        деятельности. Поэтому среди первых авторов —  ​практики и видные ученые
        с активной жизненной позицией. Особо приветствуется коллаборация
        (сотрудничество) авторов, совместная подготовка материалов следователями
        и представителями научного сообщества. Надеемся, журнал будет полезен
        для большого круга читателей.
      </div>
      <br />
      <div>
        <b>География публикаций</b> весьма широка. Кроме актуальных вопросов
        досудебного производства Беларуси, в первом номере опубликованы
        материалы российских и армянских коллег. Планируем, что в ближайших
        номерах журнала найдут достойное место статьи авторов ближнего и
        дальнего зарубежья, а его страницы станут международной площадкой по
        обмену мнениями и опытом.
      </div>
      <br />
      <div>
        <b>Миссия журнала</b> состоит не только в том, чтобы поднимать сложные
        проблемы юриспруденции, но и освещать основные этапы развития органов
        следствия республики в контексте современной истории правоохранительных
        органов, а также состояние законодательства и опыт правоприменения
        других стран.
      </div>
      <br />
      <div>
        Приглашаем оформить подписку на журнал «Предварительное расследование» (<b>каталог РУП «Белпочта»</b>,
        подписной индекс: для предприятий и организаций — ​<b>748352</b>, для
        индивидуальных подписчиков — <b>74835</b>).
      </div>
      <br />
    </div>
  );
}
