app/controllers/static_pages_controller.rb

SELECT  "static_pages".* FROM "static_pages" WHERE "static_pages"."slug" = $1 LIMIT $2  [["slug", "policy"], ["LIMIT", 1]]
---
  def show
    @static_page = StaticPage.find_by(slug: params[:id])